EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
//
// "I am not so much concerned with the return on capital as I am with the return of capital." - Will Rogers
//

#include "../esos/include/esos.h"
#include "../esos/include/pic24/esos_pic24.h"
#include "../esos/include/pic24/esos_pic24_rs232.h"
#include "../esos/include/pic24/esos_pic24_spi.h"
#include "../lib/include/pic24_timer.h"
#include "../lib/include/pic24_util.h"
#include "../lib/include/pic24_adc.h"
#include "../lib/include/pic24_ports_config.h"
#include "../lib/include/pic24_ports_mapping.h"
//#include "../../AVR_t6963/key_defs.h"
#include <stdio.h>
#include <string.h>
// DEFINEs go here
//#define   CONFIG_LED1()   printf("called CONFIG_LED1()\n");
uint8_t     LED1 = TRUE;      // LED1 is initially "on"
#define MY_ESOS1
#define TEMP_DELAY		5000
#define TEMP_DELAY3		2
#define TEMP_DELAY2		1000
#define TDELAY 2
#define TDELAY2 1
#define VREF 3.3  //assume Vref = 3.3 volts
#define FLAG1        ESOS_USER_FLAG_1
#define RT_OFFSET 0x70
//#define AVR_SEND_DATA_SIZE 1024	// this should be the same as AUX_STRING_LEN in AVR_t6963/main.h
#define AVR_SEND_DATA_SIZE 1024
#define NO_MENU_LABELS_EEPROM_LOCATION 0x03e0
#define NO_RT_LABELS_EEPROM_LOCATION 0x03e4
#define NO_RTPARAMS_EEPROM_LOCATION 0x03e8
#define NO_MENUS_EEPROM_LOCATION 0x3ea
#define RT_PARAMS_OFFSET_EEPROM_LOCATION 0x0350
#define MAX_LABEL_LEN 10
#define RT_OFFSET 0x70
int get_label(int index, char *str);

volatile int goffset;

int pack(UCHAR low_byte, UCHAR high_byte);
void unpack(int myint, UCHAR *low_byte, UCHAR *high_byte);
int update_menu_structs(int i, UCHAR fptr, UCHAR menu0, UCHAR menu1, UCHAR menu2, UCHAR menu3,
			UCHAR menu4, UCHAR menu5, UCHAR index);
UCHAR menu_change(UCHAR ch);
UCHAR do_exec(UCHAR ch);
UCHAR do_chkbox(UCHAR ch);
UCHAR non_func(UCHAR ch);
UCHAR do_numentry(UCHAR ch);
int prev_list(void);
volatile int current_fptr;		// pointer into the menu_list[]
volatile int prev_fptr;
volatile int list_size;
volatile int dirty_flag;
int send_aux_data;
int curr_checkbox;
int last_checkbox;
int curr_execchoice;
int last_execchoice;
volatile int first_menu;


#define LIST_SIZE 50

volatile int menu_list[LIST_SIZE];	// works like a stack for the how deep into the menus we go
UCHAR set_list(int fptr);
UCHAR get_fptr(void);
void get_fptr_label(char *str);
int get_curr_menu_index(void);
int get_curr_menu(void);

enum data_types
{
	RT_LOW,				// uint8_t without high bit set
	RT_HIGH0,			// uint8_t with bit 7 set
	RT_HIGH1,			// UINT with neither 7 or 15 set
	RT_HIGH2,			// bit 7 of UINT set
	RT_HIGH3			// bit 15 of UINT set
} DATA_TYPES;

// warning: these are also defined in the AVR directory
// got mult defined errors if enums have the same names
// but got undefined errors if left out ???
typedef struct rt_params
{
	UCHAR row;			// row, col tells where the param will appear on screen
	UCHAR col;
	UCHAR shown;		// SHOWN_SENT = shown & sent; NOSHOWN_SENT = sent but not shown; NOSHOWN_NOSENT
	UCHAR dtype;		// 0 = UCHAR; 1 = UINT; 2 = dword?
	UCHAR type;			// rt_types
} RT_PARAM;

enum shown_types
{
	SHOWN_SENT,
	NOSHOWN_SENT,
	NOSHOWN_NOSENT
} SHOWN_TYPES;

enum key_types
{
	KP_POUND = 0xE0, // '#'
	KP_AST, // '*'	- E1
	KP_0, // '0'	- E2
	KP_1, // '1'	- E3
	KP_2, // '2'	- E4
	KP_3, // '3'	- E5
	KP_4, // '4'	- E6
	KP_5, // '5'	- E7
	KP_6, // '6'	- E8
	KP_7, // '7'	- E9
	KP_8, // '8'	- EA
	KP_9, // '9'	- EB
	KP_A, // 'A'	- EC
	KP_B, // 'B'	- ED
	KP_C, // 'C'	- EE
	KP_D, // 'D'	- EF
	INIT, //		- F0
	READ_EEPROM,//	- F1
	SPACE,	//		- F2
	SHOW_EEPROM, //	- F3
	SHOW_MENU_STRUCT, //- F4
	LOAD_MENU_STRUCT, // - F5
	BURN_PART,		// - F6
	BURN_PART1,		// - F7
	BURN_PART2,		// - F8
	BURN_PART3,		// - F9
	BURN_PART4		// - FA
} KEY_TYPES2;

enum non_func_type
{
	NF_1 = 0xB0,
	NF_2,
	NF_3,
	NF_4,
	NF_5,
	NF_6,
	NF_7,
	NF_8,
	NF_9,
	NF_10
} NON_FUNC_TYPES2;

enum rt_types
{
	RT_RPM = RT_OFFSET,
	RT_ENGT,
	RT_TRIP,
	RT_TIME,
	RT_AIRT,
	RT_MPH,
	RT_OILP,
	RT_MAP,
	RT_OILT,
	RT_O2,
} RT_TYPES;

enum menu_types
{
	MAIN,		// 0
	MENU1A,		// 1
	MENU1B,		// 2
	MENU1C,		// 3
	MENU1D,		// 4
	MENU1E,		// 5
	MENU2A,		// 6
	MENU2B,		// 7
	MENU2C,		// 8
	MENU2D,		// 9
	MENU2E,		// 10
	MENU3A,		// 11
	MENU3B,		// 12

	ckenter,	// 13
	ckup,		// 14
	ckdown,		// 15
	cktoggle,	// 16
	ckesc,		// 17

	entr,		// 18
	forward,	// 19
	back,		// 20
	eclear,		// 21
	esc,		// 22

	caps,		// 23
	small,		// 24
	spec,		// 25
	next,		// 26

	blank,		// 27
	rpm,
	engt,
	trip,
	time,
	airt,
	mph,
	oilp,
	map,
	oilt,
	o2,
	test
} MENU_TYPES;

enum fptr_types
{
	_menu_change,
	_exec_choice,
	_do_chkbox,
	_non_func,
	_do_numentry
} FPTR_TYPES;

#define NUM_MENUS 13

typedef struct menu_func
{
//	int _index;
	UCHAR fptr;								// which function to call (menu_types)
	int menus[6];							// which menu to goto if _menu_change is the fptr
	UCHAR index;
} MENU_FUNC_STRUCT;

MENU_FUNC_STRUCT menu_structs[NUM_MENUS];

#define NUM_FPTS 6

static UCHAR (*fptr[NUM_FPTS])(UCHAR) = { menu_change, do_exec, do_chkbox, non_func, do_numentry };

volatile uint8_t row;
volatile uint8_t cmd;
volatile uint8_t data;
volatile UINT32 U32_lastCapture; // UINT32 declared in all_generic.h
#define KEYPAD_DELAY    100
#define KEYPAD_DEBOUNCE_DELAY 2

#define MAX_LABEL_LEN 10
#define NUM_LABELS 40
#define NUM_RT_PARAMS 10
volatile uint8_t col;
volatile uint8_t last_code;
volatile uint8_t user_flag;

#define NUM_RT_LABELS NUM_RT_PARAMS

volatile int label_offsets[NUM_LABELS+NUM_RT_LABELS];

volatile uint16_t total_offset;
volatile uint16_t no_menu_labels;
volatile uint16_t no_rtparams;
volatile uint16_t no_rt_labels;

volatile UCHAR avr_send_data[AVR_SEND_DATA_SIZE];

volatile char labels[NUM_LABELS][MAX_LABEL_LEN] =
//#if 0
{"home\0","MENU1a\0","MENU1b\0","MENU1c\0","MENU1d\0","MENU1e\0","MENU2a\0","MENU2B\0","MENU2c\0","MENU2d\0","MENU2e\0","MENU3a\0","MENU3b\0",\
\
"enter\0","up\0","down\0","toggle\0","esc\0","enter\0","forward\0","back\0","clear\0","escape\0",\
\
"caps\0","small\0","spec\0","next\0",\
\
"\0","RPM\0","ENG TEMP\0","TRIP\0","TIME\0","AIR TEMP\0","MPH\0","OIL PRES\0","MAP\0","OIL TEMP\0","O2\0","test\0",\
"oh f*ck\0"};
//#endif

RT_PARAM rt_params[NUM_RT_PARAMS] = {
 {1, 0, SHOWN_SENT, 1, RT_RPM},
 {2, 0, SHOWN_SENT, 0, RT_ENGT},
 {3, 0, SHOWN_SENT, 0, RT_TRIP},
 {4, 0, SHOWN_SENT, 0, RT_TIME},
 {5, 0, SHOWN_SENT, 0, RT_AIRT},
 {1, 15, SHOWN_SENT, 0, RT_MPH},
 {2, 15, SHOWN_SENT, 0, RT_OILP},
 {3, 15, SHOWN_SENT, 0, RT_MAP},
 {4, 15, SHOWN_SENT, 0, RT_OILT},
 {5, 15, SHOWN_SENT, 0, RT_O2} };


UCHAR get_key(UCHAR ch, int size, int start_addr, UCHAR *str, int type);
UCHAR get_key(UCHAR ch, int size, int start_addr, UCHAR *str, int type)
{
	return ch;
}

UCHAR menu_change(UCHAR ch)
{
	UCHAR ret_char = ch;
	int menu_index = 0;
	int curr_menu;

